
//Найти расстояние между точками в пространстве 2D/3D
//√((x2-x1)^2 )+(y2-y1)^2) 
// √((x2-x1)^2 )+(y2-y1)^2+(z2-z1)^2)
// double d = Math.Sqrt(16);
// double i = Math.Pow(5, 2);
// x1=8; y1=5; x2=; y2=16.
double vector2D = Math.Sqrt((4 - 8) * (4 - 8) + (16 - 5) * (16 - 5));
Console.WriteLine($"{"расстояние между точками в пространстве 2D ="} {vector2D}");
// x1=6; y1=2; z1=7; x2=12; y2=5; z2=15/
double vector3D = Math.Sqrt((12 - 6) * (12 - 6) + (5 - 2) * (5 - 2) + (15 - 7) * (15 - 7));
Console.WriteLine($"{"расстояние между точками в пространстве 3D ="} {vector3D}");