Console.WriteLine("Написать программу вычисления значения функции y = f(a)");
// f(a) = a^2 + 1
Console.WriteLine("Введите значение a: ");
int a = int.Parse(Console.ReadLine());
int y = a * a + 1;
Console.Write("y = ");
Console.WriteLine(y);

